app/views/contacts/index.html.erb

        <div class="well">
          <h4>First Name: <a href="contacts/<%= contact.id %>"><%= contact.first_name %></a></h4>
---
SELECT "contacts".* FROM "contacts"