app/controllers/contacts_controller.rb

  def create
    @contact = Contact.create(
      first_name: params[:first_name],
      last_name: params[:last_name],
      email: params[:email],
      phone_number: params[:phone_number]
      )
---
INSERT INTO "contacts" ("first_name", "last_name", "email", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @contact = Contact.find(params[:id])
    @contact.update(
      first_name: params[:first_name],
      last_name: params[:last_name],
      email: params[:email],
      phone_number: params[:phone_number]
      )
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "contacts" SET "first_name" = $1, "last_name" = $2, "email" = $3, "phone_number" = $4, "updated_at" = $5 WHERE "contacts"."id" = $6  [["first_name", "Franl"], ["last_name", "Radogna"], ["email", ""], ["phone_number", ""], ["updated_at", 2017-05-09 21:56:20 UTC], ["id", 1]]